In [1]:
def CalcSum(*args):

    print('Type of variable:',type(args))


    if len(args)>1:

        print('The second arg is ',args[1])

    output = sum(args)

    return output

In [2]:
CalcSum(5,6,8,9,2,6,1)

Type of variable: <class 'tuple'>
The second arg is  6

37

In [1]:
def PrintMessage(*xyz):

    for arg in xyz:

        print(arg)

In [2]:
PrintMessage(5,"apple",'orange',False,96)

5
apple
orange
False
96

In [5]:
## Kwargs


def Vehicles(**kwargs):

    print(type(kwargs))

    print(kwargs['water'])

    for key,val in kwargs.items():

        print(val ,' is running on ',key)

In [6]:
Vehicles(land='bus',water='ship',air='airplane')

bus  is running on  land
ship  is running on  water
airplane  is running on  air

In [7]:
Vehicles(land='bus',water='ship',air='airplane')

bus  is running on  land
ship  is running on  water
airplane  is running on  air

In [8]:

def Vehicles(**kwargs):

    print(type(kwargs))

    print(kwargs['water'])

    for key,val in kwargs.items():

        print(val ,' is running on ',key)

In [9]:
Vehicles(land='bus',water='ship',air='airplane')

<class 'dict'>
ship
bus  is running on  land
ship  is running on  water
airplane  is running on  air

### Decorators - Functions which could be used to modify the behaviour of another function

In [1]:
def Subtraction(a,b):

    return a-b

In [2]:
Subtraction(10,5)

5

In [3]:
Subtraction(5,10)

-5

In [13]:
def SubtractDecorator(func):

    def ChangeBehaviour(*args):

        print(args)

        if args[0] > args[1]:

            return func(args[0],args[1])
        
        else:

            return func(args[1],args[0])
    
    return ChangeBehaviour

In [14]:

@SubtractDecorator
def Subtraction(a,b):

    return a-b

In [15]:
Subtraction(5,10)

NameError: name 'b' is not defined

In [ ]:
Subtraction(5,10)

## OOPS

In [3]:
class Profile():

    def __init__(self,name,email_address,password,job_title):

        self.name = name

        self.email_address = email_address

        self.password = password

        self.job_title = job_title
    

    def PrintProfile(self):

        print("Name".ljust(25,' '),':',self.name)
        print("Email Address".ljust(25,' '),':',self.email_address)
        print("Password".ljust(25,' '),':',self.password)
        print("Job Title".ljust(25,' '),':',self.job_title)

In [4]:
person1=Profile('chandrakanth',"chandrakanth@abc.com",'ABCD@1234','Data Scientist')

In [5]:
person1.PrintProfile()

Name                      : chandrakanth
Email Address             : chandrakanth@abc.com
Password                  : ABCD@1234
Job Title                 : Data Scientist

In [6]:
person1.name

'chandrakanth'

In [7]:
person1.job_title

'Data Scientist'

In [9]:
person1.password="********"

In [ ]:
person1.name

In [10]:
person1.PrintProfile()

Name                      : chandrakanth
Email Address             : chandrakanth@abc.com
Password                  : ********
Job Title                 : Data Scientist

Why do we use class method ?

1) Encapsulation - Attributes & Methods Works Together As A Single Unit
2) Abstraction - Simplifying the interface & protecting variables
3) Inheritance - inherit methods & attributes from parent class
4) Polymorphism - Class methods change in behavious based on inherited class

In [4]:
class Profile():

    country = 'India'

    def __init__(self,name,email_address,password,job_title):

        self.name = name

        self.email_address = email_address

        self.__password = password

        self.job_title = job_title
    

    def PrintProfile(self):

        print("Name".ljust(25,' '),':',self.name)
        print("Email Address".ljust(25,' '),':',self.email_address)
        print("Password".ljust(25,' '),':',self.__password)
        print("Job Title".ljust(25,' '),':',self.job_title)
        print('Country:'.ljust(25,' '),':',Profile.country)
    

    def __ProtectedMethod(self):

        print('I shouldnt be accessed outside')
    

    def GivePassword(self):

        return self.__password

In [5]:
p1=Profile('chandrakanth','ck@gmail.com','Test@1234','Data Scientist')

In [7]:
p1.country

'India'

In [3]:
p1.__password

AttributeError: 'Profile' object has no attribute '__password'

In [4]:
p1.GivePassword()

'Test@1234'

In [3]:
p1.__ProtectedMethod()

AttributeError: 'Profile' object has no attribute '__ProtectedMethod'

In [8]:
p1.__password = "********"

In [9]:
p1.__password

'********'

In [6]:
p1.PrintProfile()

Name                      : chandrakanth
Email Address             : ck@gmail.com
Password                  : Test@1234
Job Title                 : Data Scientist
Country:                  : India

In [7]:
Profile.country

'India'

In [8]:
Profile.name

AttributeError: type object 'Profile' has no attribute 'name'

### Inheritance

In [1]:
class Parent():

    lives_in = 'chennai'

    def PrintHelloWorld(self):

        print('Hello WOrld')

In [6]:
class Child(Parent):

    def __init__(self,name):
        
        self.name=name
    
    def AddFriend(self,friend_name):

        self.friend = friend_name
    
    def FriendsWith(self):

        print('Friend of', self.friend)

In [7]:
c1=Child(name='abcd')

In [8]:
c1.AddFriend('efgh')

In [4]:
c1.PrintHelloWorld()

Hello WOrld

In [5]:
c1.lives_in

'chennai'

In [10]:
c1.FriendsWith()

Friend of efgh

In [ ]:
## Polymorphism

In [1]:
class Transport:

    def __init__(self,name):

        self.name = name

    def Move(self):

        print('I move from a to b')


class Road(Transport):

    def Move(self):

        print('I move via road from a to b')


class Water(Transport):

    def Move(self):

        print('I move via canals from a to b')

In [2]:
t1 = Transport(name='test')

In [4]:
t1.Move()

I move from a to b

In [5]:
r1 = Road(name='road transport')

In [6]:
r1.Move()

I move via road from a to b

In [2]:
w1 = Water(name='water transport')

In [3]:
w1.Move()

I move via canals from a to b

## Exception Handling

In [2]:
try:

    nom = int(input('Enter the nominator:'))

    denom = int(input('Enter the denominator:'))

    result = nom / denom

    print('The Result Is ' ,result)

except ValueError:

    print('Not A Valid Number!!!')

except ZeroDivisionError:

    print('Denominator cannot be zero')

Denominator cannot be zero

# Find The heirarchial structure with this exceptions 

ValueError
ZeroDivisionError
KeyError
TypeError
BaseException
Exception
KeyboardInterrupt

# Open & Os module

In [1]:
task_game = open('task_tic_tac_toe.txt','r')

In [2]:
task_instructions = task_game.read()

In [3]:
print(task_instructions)

Create a Tic-Tac-Toe using instructions given below

Setup the Game Board:

Create a function to display the game board.
Use a list to represent the board.
Initialize the Game:

Create a function to initialize the game.
Set up an empty board and determine the starting player.


Player Input:

Create a function to handle player input.
Ensure the input is valid (a number between 1 and 9, and an empty position).


Update the Board:

Create a function to update the board with the player's move.

Check for a Win or Tie:

Create a function to check if a player has won.
Create a function to check if the game is a tie.

Switch Player:

Create a function to switch between players.

Main Game Loop:

Create a function that ties all previous functions together in a loop.
Display the board, get player input, update the board, check for a win or tie, and switch players.

Start the Game:

Add a condition to start the game when the script is run.

In [1]:
birthday_msg_file = open('birthday_greeting.txt','w')

In [2]:
birthday_msg_file.write("Happy birthday to you !!! ")

26

In [3]:
birthday_msg_file.close()

In [4]:
birthday_edit = open('birthday_greeting.txt','a')

In [5]:
birthday_edit.write('This is a new line of text I am adding to source file.')

54

In [6]:
birthday_edit.close()

OS Module

In [2]:
import os

In [2]:
print(os.getcwd())

/home/chandrakanth/MSME_Python_AI_July_Batch

In [3]:
os.mkdir("My Folder")

In [4]:
os.rename('FOLDERTEST','My Folder')

In [6]:
os.rmdir("My Folder")

In [5]:
os.listdir()

['My Folder',
 'birthday_greeting.txt',
 'venv',
 'python_basics_advanced.ipynb',
 'advanced_python.ipynb',
 'python2.ipynb',
 'task_tic_tac_toe.txt']

In [7]:
"My Folder" in os.listdir()

False

In [5]:
if 'My Folder' in os.listdir():

    os.rmdir('My Folder')

    print('FOlder getting removed')

else:

    print('Folder already removed')

Folder already removed

## Pandas Dataframe

In [1]:
import pandas as pd

In [2]:
staff_df=pd.read_csv('staff_data.csv')

In [3]:
staff_df

       Name Department  Salary  Years_of_Experience
0     Alice         HR   50000                    5
1       Bob         IT   60000                    3
2   Charlie    Finance   70000                    7
3     David         HR   45000                    2
4       Eva         IT   65000                    4
5     Frank    Finance   75000                    8
6     Grace         HR   55000                    6
7    Hannah         IT   70000                    5
8       Ian    Finance   80000                   10
9      Jack         HR   48000                    3
10     Kara         IT   72000                    7
11      Leo    Finance   68000                    6
12      Mia         HR   47000                    4
13   Nathan         IT   68000                    5
14   Olivia    Finance   77000                    9
15     Paul         HR   52000                    5
16   Quincy         IT   63000                    3
17   Rachel    Finance   74000                    8
18    Steve         HR   53000                    4
19     Tina         IT   69000                    6

In [4]:
staff_df.head(5)

      Name Department  Salary  Years_of_Experience
0    Alice         HR   50000                    5
1      Bob         IT   60000                    3
2  Charlie    Finance   70000                    7
3    David         HR   45000                    2
4      Eva         IT   65000                    4

In [5]:
staff_df.tail(3)

      Name Department  Salary  Years_of_Experience
17  Rachel    Finance   74000                    8
18   Steve         HR   53000                    4
19    Tina         IT   69000                    6

In [6]:
staff_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 4 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   Name                 20 non-null     object
 1   Department           20 non-null     object
 2   Salary               20 non-null     int64
 3   Years_of_Experience  20 non-null     int64
dtypes: int64(2), object(2)
memory usage: 768.0+ bytes

In [7]:
staff_df.dtypes

Name                   object
Department             object
Salary                  int64
Years_of_Experience     int64
dtype: object

In [8]:
staff_df['Name'].unique()

array(['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank', 'Grace',
       'Hannah', 'Ian', 'Jack', 'Kara', 'Leo', 'Mia', 'Nathan', 'Olivia',
       'Paul', 'Quincy', 'Rachel', 'Steve', 'Tina'], dtype=object)

In [9]:
staff_df.Name.unique

<bound method Series.unique of 0       Alice
1         Bob
2     Charlie
3       David
4         Eva
5       Frank
6       Grace
7      Hannah
8         Ian
9        Jack
10       Kara
11        Leo
12        Mia
13     Nathan
14     Olivia
15       Paul
16     Quincy
17     Rachel
18      Steve
19       Tina
Name: Name, dtype: object>

In [10]:
staff_df['Years_of_Experience']

0      5
1      3
2      7
3      2
4      4
5      8
6      6
7      5
8     10
9      3
10     7
11     6
12     4
13     5
14     9
15     5
16     3
17     8
18     4
19     6
Name: Years_of_Experience, dtype: int64

In [11]:
staff_df.sort_values(by=['Years_of_Experience'],ascending=False,inplace=True)

In [12]:
staff_df

       Name Department  Salary  Years_of_Experience
8       Ian    Finance   80000                   10
14   Olivia    Finance   77000                    9
5     Frank    Finance   75000                    8
17   Rachel    Finance   74000                    8
10     Kara         IT   72000                    7
2   Charlie    Finance   70000                    7
11      Leo    Finance   68000                    6
19     Tina         IT   69000                    6
6     Grace         HR   55000                    6
15     Paul         HR   52000                    5
0     Alice         HR   50000                    5
13   Nathan         IT   68000                    5
7    Hannah         IT   70000                    5
12      Mia         HR   47000                    4
18    Steve         HR   53000                    4
4       Eva         IT   65000                    4
9      Jack         HR   48000                    3
1       Bob         IT   60000                    3
16   Quincy         IT   63000                    3
3     David         HR   45000                    2

In [13]:
staff_df['Salary'][2]

np.int64(70000)

In [14]:
staff_df.loc[staff_df['Name']=='Charlie','Salary']

2    70000
Name: Salary, dtype: int64

In [16]:
staff_df.loc[(staff_df['Department']=='IT') & 
             (staff_df['Salary'] > 63000),['Name',"Years_of_Experience"]]

      Name  Years_of_Experience
10    Kara                    7
19    Tina                    6
13  Nathan                    5
7   Hannah                    5
4      Eva                    4

In [17]:
text="""Name,Department,Salary,Years_of_Experience
Alice,HR,50000,5
Bob,IT,60000,3
Charlie,Finance,70000,7
David,HR,45000,2
Eva,IT,65000,4
Frank,Finance,75000,8
Grace,HR,55000,6
Hannah,IT,70000,5
Ian,Finance,80000,10
Jack,HR,48000,3
Kara,IT,72000,7
Leo,Finance,68000,6
Mia,HR,47000,4
Nathan,IT,68000,5
Olivia,Finance,77000,9
Paul,HR,52000,5
Quincy,IT,63000,3
Rachel,Finance,74000,8
Steve,HR,53000,4
Tina,IT,69000,6"""

### Pandas methods

* Group By
* Join
* Pivot

### API - Flask

* GET
* POST

### Visualization Using Matplotlib & Plotly

* barchart
* linechart
* piechart

### Building an app using Streamlit

* Interactive UI and charts deployed as app

In [1]:
import pandas as pd

data=pd.read_csv('staff_data.csv')

In [2]:
data

       Name Department  Salary  Years_of_Experience
0     Alice         HR   50000                    5
1       Bob         IT   60000                    3
2   Charlie    Finance   70000                    7
3     David         HR   45000                    2
4       Eva         IT   65000                    4
5     Frank    Finance   75000                    8
6     Grace         HR   55000                    6
7    Hannah         IT   70000                    5
8       Ian    Finance   80000                   10
9      Jack         HR   48000                    3
10     Kara         IT   72000                    7
11      Leo    Finance   68000                    6
12      Mia         HR   47000                    4
13   Nathan         IT   68000                    5
14   Olivia    Finance   77000                    9
15     Paul         HR   52000                    5
16   Quincy         IT   63000                    3
17   Rachel    Finance   74000                    8
18    Steve         HR   53000                    4
19     Tina         IT   69000                    6

In [3]:
data.groupby('Department')['Salary'].mean().reset_index()

  Department        Salary
0    Finance  74000.000000
1         HR  50000.000000
2         IT  66714.285714

Joins

> Inner Joins
> Left Joins
> Right Joins
> Outer Joins

![Joins](https://phoenixnap.com/kb/wp-content/uploads/2021/04/join-types.png)

In [15]:
df_a = pd.DataFrame().from_dict([
    {
        "Category":"A",
        "Sales":250
    },
    {
        "Category":"B",
        "Sales":450
    },
    {
        "Category":"C",
        "Sales":650
    },
    {
        "Category":"D",
        "Sales":850
    },
    {
        "Category":"E",
        "Sales":150
    },
    {
        "Category":"F",
        "Sales":200
    }
    ])

In [3]:
df_a

  Category  Sales
0        A    250
1        B    450
2        C    650
3        D    850
4        E    150
5        F    200

In [16]:
df_b = pd.DataFrame(
    {'Project_Category':["A","B","C","D","E","J"],
     "Profit":[65,85,24,45,68,82]}
)

In [5]:
df_b

  Category  Profit
0        A      65
1        B      85
2        C      24
3        D      45
4        E      68
5        J      82

In [17]:
# inner join

df_inner_join = pd.merge(df_a,df_b,how='inner',
                         left_on=['Category'],right_on=['Project_Category'])

In [18]:
df_inner_join

  Category  Sales Project_Category  Profit
0        A    250                A      65
1        B    450                B      85
2        C    650                C      24
3        D    850                D      45
4        E    150                E      68

In [9]:
df_left_join = pd.merge(df_a,df_b,how='left')

In [10]:
df_left_join

  Category  Sales  Profit
0        A    250    65.0
1        B    450    85.0
2        C    650    24.0
3        D    850    45.0
4        E    150    68.0
5        F    200     NaN

In [11]:
df_right_join = pd.merge(df_a,df_b,how='right')

In [12]:
df_right_join

  Category  Sales  Profit
0        A  250.0      65
1        B  450.0      85
2        C  650.0      24
3        D  850.0      45
4        E  150.0      68
5        J    NaN      82

In [13]:
df_outer_join = pd.merge(df_a,df_b,how='outer')

In [14]:
df_outer_join

  Category  Sales  Profit
0        A  250.0    65.0
1        B  450.0    85.0
2        C  650.0    24.0
3        D  850.0    45.0
4        E  150.0    68.0
5        F  200.0     NaN
6        J    NaN    82.0

In [19]:
### Pivoting

In [20]:
data

       Name Department  Salary  Years_of_Experience
0     Alice         HR   50000                    5
1       Bob         IT   60000                    3
2   Charlie    Finance   70000                    7
3     David         HR   45000                    2
4       Eva         IT   65000                    4
5     Frank    Finance   75000                    8
6     Grace         HR   55000                    6
7    Hannah         IT   70000                    5
8       Ian    Finance   80000                   10
9      Jack         HR   48000                    3
10     Kara         IT   72000                    7
11      Leo    Finance   68000                    6
12      Mia         HR   47000                    4
13   Nathan         IT   68000                    5
14   Olivia    Finance   77000                    9
15     Paul         HR   52000                    5
16   Quincy         IT   63000                    3
17   Rachel    Finance   74000                    8
18    Steve         HR   53000                    4
19     Tina         IT   69000                    6

In [26]:
stats_department= pd.pivot_table(data=data,index=['Department'],
                                 values=['Salary','Years_of_Experience'],
                                 aggfunc='mean')

In [27]:
stats_department

                  Salary  Years_of_Experience
Department
Finance     74000.000000             8.000000
HR          50000.000000             4.142857
IT          66714.285714             4.714286

In [23]:
stats_department.reset_index(inplace=True)

In [25]:
stats_department.to_csv('department_report.csv')